performance.yml
config:
  plugins:
    faker:
      locale: en
  variables:
    taskName: "$faker.lorem.words"
    newTaskName: "$faker.lorem.words"
    taskDate: "$faker.date.future"
    newTaskDate: "$faker.date.future"

  environments:
    production:
      target: "https://api.todoist.com"
      phases:
        - duration: 7
          arrivalRate: 3
          name: "Phase1"
    staging:
      target: "https://localhost:9080"
      phases:
        - duration: 320
          arrivalRate: 10
          name: "Phase 1"
        - duration: 320
          arrivalRate: 30
          name: "Phase 2"
        - duration: 480
          arrivalRate: 80
          name: "Phase 3"
  defaults:
    headers:
      Authorization: Bearer {{ $processEnvironment.TOKEN }} #export TOKEN required
      Content-Type: application/json

scenarios:
  - name: "Performance test for tasks"
    flow:
      - get:
          name: "Get active tasks"
          url: "/rest/v1/tasks"

      - post:
          name: "Create a new task"
          url: "/rest/v1/tasks"
          json:
            content: "{{taskName}}"
            due_string: "{{taskDate}}"
            due_lang: "en"
            priority: 4
          capture:
            json: "$.id"
            as: "idTask"
#      - log: "Create new task Id: {{idTask}}"

      - get:
          name: "Get an active task"
          url: "/rest/v1/tasks/{{idTask}}"
          capture:
            json: "$.content"
            as: "taskContent"
#      - log: "Get active task: {{idTask}}-{{taskContent}}"

      - post:
          name: "Update an active task"
          url: "/rest/v1/tasks/{{idTask}}"
          json:
            content: "{{taskName}}"
            due_string: "{{newTaskDate}}"
#      - log: "Updated task Id: {{idTask}} > {{taskContent}} To: {{newTaskName}} {{newTaskDate}}"

      - post:
          name: "Change a task status to complete"
          url: "/rest/v1/tasks/{{idTask}}/close"
#      - log: "Complete task Id: {{idTask}}"

      - post:
          name: "Reopen a task"
          url: "/rest/v1/tasks/{{idTask}}/reopen"
#      - log: "Reopen task Id: {{idTask}}"

      - delete:
          url: "/rest/v1/tasks/{{idTask}}"
#      - log: "Deleted task Id: {{idTask}}"